
const animals = ["空的","虎人","貓妖","羅剎","貓人","惡魔貓","妖狐","穴熊","赤熊","北極熊","赤目黑熊",										//00~10, not use the index 0
				 "貓熊","大地鼠","惡夢鼠","火焰鼠","寶石鼠","水藍鼠","鼠王","地獄看門犬","巨狼","地獄獵犬",									//11~20
				 "地獄妖犬","殭屍","喪屍","食屍鬼","腐屍","木乃伊","骷髏戰士","血骷髏","地獄骷髏","武裝骷髏",								//21~30
				 "骷髏海盜","幽靈","鬼靈","亡靈","死靈","小石像怪","使魔","水藍鳥魔","小惡魔","迷你石像怪",									//31~40
				 "丘比特","石像怪","血魔","墮天使","惡魔","小蝙蝠","掃把蝙蝠","迷你蝙蝠","水果蝙蝠","惡魔蝙蝠",								//41~50
				 "天使蝙蝠","大蝙蝠","巨蝙蝠","海蝙蝠","胖蝙蝠","兔耳蝙蝠","藍蠍","紅蠍","黃蠍","殺手蠍",									//51~60
				 "殺人蜂","異型蜂","虎頭蜂","黃蜂","死亡蜂","螳螂","殺人螳螂","赤目螳螂","死灰螳螂","致命螳螂",								//61~70
				 "土蜘蛛","水蜘蛛","火蜘蛛","風蜘蛛","樹精","死亡樹精","黃金樹精","慘白樹精","冰冷樹精","沼澤樹精",							//71~80
				 "妖草","蔓陀羅草","妖花","人魔草","綠色口臭鬼","黃色口臭鬼","藍色口臭鬼","紅色口臭鬼","凶暴仙人掌","武術仙人掌",			//81~90
				 "兔耳仙人掌","印地安仙人掌","火焰舞者","史萊姆","液態史萊姆","果凍史萊姆","布丁史萊姆","火精","風精","水精",				//91~100
				 "地精","頑皮炸彈","寶貝炸彈","大炸彈","漂浮炸彈","丸子炸彈","幻影","旋律影子","闇影","陰影",								//101~110
				 "血腥之刃","殺龍之刃","火焰之刃","烈風之刃","嚇人箱","兔耳嚇人箱","紅魔嚇人箱","藍魔嚇人箱","綠蛙嚇人箱","純白嚇人箱",		//111~120
				 "冰怪","石怪","銀怪","金怪","惡魔螃蟹","水晶螃蟹","鐵剪螃蟹","黃金螃蟹","蜥蜴戰士","蜥蜴鬥士",								//121~130
				 "蜥蜴武士","獵豹蜥蜴","大地翼龍","寒冰翼龍","火焰翼龍","烈風翼龍","翼龍","地龍蜥","水龍蜥","火龍蜥",						//131~140
				 "風龍蜥","哥布林","紅帽哥布林","火焰哥布林","烈風哥布林","巨人","單眼巨人","泰坦巨人","亞特拉斯巨神","盜賊",				//141~150
				 "山賊","海盜","破壞狂","鳥人","幻歌妖","狠毒鳥人","烈風鳥人","黑暗鳥人",													//151~158		
];